{"reviewerID": "A1VEELTKS8NLZB", "asin": "616719923X", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Just another flavor of Kit Kat but the taste is unique and a bit different.  The only thing that is bothersome is the price.  I thought it was a bit expensive....", "overall": 4.0, "summary": "Good Taste", "unixReviewTime": 1370044800, "reviewTime": "06 1, 2013"}
{"reviewerID": "A14R9XMZVJ6INB", "asin": "616719923X", "reviewerName": "amf0001", "helpful": [0, 1], "reviewText": "I bought this on impulse and it comes from Japan,  which amused my family,  all those weird stamps and markings on the package. So that was fun.  It said it would take about a month to arrive and it did take that long.  I was hoping for a more interesting taste but to our family,  it just tasted a bit less flavorful or weaker than the standard milk chocolate kit kat.  The green tea flavor was too subtle for the sugar and it just tasted sweet. The wafers were very crispy, and that was good,  but it tasted a bit anemic to us.I'm happy I bought it, but don't need to buy it again.", "overall": 3.0, "summary": "3.5 stars,  sadly not as wonderful as I had hoped", "unixReviewTime": 1400457600, "reviewTime": "05 19, 2014"}
{"reviewerID": "A27IQHDZFQFNGG", "asin": "616719923X", "reviewerName": "Caitlin", "helpful": [3, 4], "reviewText": "Really good. Great gift for any fan of green tea! Just so expensive to purchase candy from across the sea.", "overall": 4.0, "summary": "Yum!", "unixReviewTime": 1381190400, "reviewTime": "10 8, 2013"}
{"reviewerID": "A31QY5TASILE89", "asin": "616719923X", "reviewerName": "DebraDownSth", "helpful": [0, 0], "reviewText": "I had never had it before, was curious to see what it was like. Smooth, great subtle good flavor. I am ordering more and plan to make it a routine.", "overall": 5.0, "summary": "Unexpected flavor meld", "unixReviewTime": 1369008000, "reviewTime": "05 20, 2013"}
{"reviewerID": "A2LWK003FFMCI5", "asin": "616719923X", "reviewerName": "Diana X.", "helpful": [1, 2], "reviewText": "I've been looking forward to trying these after hearing about how popular they were in Japan, and among Kit Kat fans as well. I do not recommend ordering these during warm weather, because they can melt and become smushy. I ordered mine right when summer began, and they were a bit mushy so I let them solidify under room temp. Afterwards, I tried some and they tasted fine. I was expecting a stronger green tea or matcha flavor, but it is actually quite subtle. The outer coating was creamy and not overly sugary, which I liked. Overall, I wouldn't say it's insanely good, but definitely a yummy treat.", "overall": 4.0, "summary": "Not a very strong tea flavor, but still yummy & creamy!", "unixReviewTime": 1369526400, "reviewTime": "05 26, 2013"}
{"reviewerID": "A1NZJTY0BAA2SK", "asin": "616719923X", "reviewerName": "Elizabeth", "helpful": [0, 1], "reviewText": "These Kit-kats are very good, but if you're looking for a strong green tea flavor- you will be disappointed. The green tea flavor is very subtle.", "overall": 4.0, "summary": "Subtle", "unixReviewTime": 1378339200, "reviewTime": "09 5, 2013"}
{"reviewerID": "AA95FYFIP38RM", "asin": "616719923X", "reviewerName": "Emily Veinglory \"Book Reviewer\"", "helpful": [1, 2], "reviewText": "I found these in a Mitsuwa Marketplace in Illinois.I actually expected them to taste better than the did.  they were okay but seem smaller than standard kit kats and the taste was a tad mild compared to other green tea candies I have tried.But still, they were pleasant enough and nice for a change.", "overall": 3.0, "summary": "Available in some US stores", "unixReviewTime": 1382054400, "reviewTime": "10 18, 2013"}
{"reviewerID": "A3FIVHUOGMUMPK", "asin": "616719923X", "reviewerName": "greenlife", "helpful": [2, 3], "reviewText": "Creamy white chocolate infused with Matcha green tea surrounding layers of wafers. Much less sweeter than the traditional Kitkat. Small size is perfect to satisfy the chocolate craving w/o the guilt. Was in LA last week and picked up a bag on a whim at the Japanese store in Little Tokyo. Now, back in WI and regretting not picking up a handful more. Not only were these Kitkats delicious, the bags were only $5 each!", "overall": 5.0, "summary": "So Delicious!!", "unixReviewTime": 1372982400, "reviewTime": "07 5, 2013"}
{"reviewerID": "A27FSPAMTQF1J8", "asin": "616719923X", "reviewerName": "Japhyl", "helpful": [0, 0], "reviewText": "After hearing mixed opinions about these Kit Kats, I decided to try them. They are excellent, and I do not regret purchasing them at all. They taste like matcha with a bit of a vanilla and milky flavor as well. They are not too sweet or too plain. These are the best Kit Kats I've ever had, and I would recommend them to anyone who likes matcha-flavored candies or anyone wanting to try an unusual kind of Kit Kat.", "overall": 5.0, "summary": "These are my favorite candies ever!", "unixReviewTime": 1371168000, "reviewTime": "06 14, 2013"}
{"reviewerID": "A33NXNZ79H5K51", "asin": "616719923X", "reviewerName": "Jean M \"JM\"", "helpful": [0, 10], "reviewText": "I love green tea, I love Kit Kats, but the two do not belong together. I hate the after taste of them.", "overall": 1.0, "summary": "Not a fan", "unixReviewTime": 1348012800, "reviewTime": "09 19, 2012"}
{"reviewerID": "A220GN2X2R47JE", "asin": "616719923X", "reviewerName": "Jeremy", "helpful": [6, 8], "reviewText": "I ordered these in Summer so they of course arrived melted, a trip the freezer made them awesome again though. Just order them in cooler times of the year and you should get them in good condition.I love these so much more than the regular chocolate Kit-Kat bars. I hope some day to see them on store shelves in the US some day.", "overall": 5.0, "summary": "Amazing!", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A3C5Z05IKSSFB9", "asin": "616719923X", "reviewerName": "M. Magpoc \"maliasuperstar\"", "helpful": [2, 3], "reviewText": "These are definitely THE BEST candy bar out there!  I just wish I was able to find them in a local store instead of having to buy them online!", "overall": 5.0, "summary": "I wish I could find these in a store instead of online!", "unixReviewTime": 1369526400, "reviewTime": "05 26, 2013"}
{"reviewerID": "AHA6G4IMEMAJR", "asin": "616719923X", "reviewerName": "M. Zinn \"mczinn\"", "helpful": [0, 0], "reviewText": "Yes - this is one of the most expensive candies around, because it only comes imported. But my goodness - are these ever good. The KitKat folks could really clean up if they started selling these in the US. Once you try them you can't wait for more. So yummy and delivered quickly and fresh.", "overall": 5.0, "summary": "Thank goodness they are expensive", "unixReviewTime": 1373068800, "reviewTime": "07 6, 2013"}
{"reviewerID": "A1Q2E3W9PRG313", "asin": "616719923X", "reviewerName": "Sabrina", "helpful": [0, 0], "reviewText": "I love the green tea kitkat, taste so good, not as sweet as the milk chocolate one, and it comes with 12 small pack, easy to keep on a diet, i love this one and the dark chocolate one!", "overall": 5.0, "summary": "it is good", "unixReviewTime": 1370649600, "reviewTime": "06 8, 2013"}
{"reviewerID": "A1P3PLYYMURAV1", "asin": "616719923X", "reviewerName": "Sunny", "helpful": [0, 0], "reviewText": "I love Kit Kat & green tea....together they are okay.  Nothing to get excited about.  I wouldn't order this again.", "overall": 3.0, "summary": "Meh", "unixReviewTime": 1380153600, "reviewTime": "09 26, 2013"}
{"reviewerID": "A38IEZF0P3ZUQJ", "asin": "616719923X", "reviewerName": "The Fallen Angel with a broken Wing \"I Cry Ou...", "helpful": [0, 0], "reviewText": "I tried this for the first time today and it is delicious but I don't quite taste the Matcha flavor as you would in like say a Green Tea ice cream. To me it tasted like white chocolate with a grainy texture which I'm guessing is the Matcha tea powder. I think my favorite KitKat flavor mix is the Mocha.", "overall": 4.0, "summary": "Not enough Matcha tea flavor for me ... (=_=)", "unixReviewTime": 1374192000, "reviewTime": "07 19, 2013"}
{"reviewerID": "A23RYWDS884TUL", "asin": "9742356831", "reviewerName": "Another Freak", "helpful": [0, 0], "reviewText": "This curry paste makes a delicious curry.  I just fried up some chicken and vegetables and added coconut milk to this for a delicious dish.  Quite spicy, so if you're looking for something mild, look elsewhere", "overall": 5.0, "summary": "Delicious!", "unixReviewTime": 1369699200, "reviewTime": "05 28, 2013"}
{"reviewerID": "A945RBQWGZXCK", "asin": "9742356831", "reviewerName": "Cheryl", "helpful": [1, 2], "reviewText": "I've purchased different curries in the grocery store and was never completely happy with the flavor. I read a recipe that recommended this brand and after using it I can see why they recommend this specific brand. Great flavor - I purchased all 3 - Green, Red, and Yellow curry paste and have enjoyed all 3 types.", "overall": 5.0, "summary": "Great flavor", "unixReviewTime": 1347840000, "reviewTime": "09 17, 2012"}
{"reviewerID": "A1TCSC0YWT82Q0", "asin": "9742356831", "reviewerName": "GinSing", "helpful": [2, 2], "reviewText": "I love ethnic foods and to cook them. I recently purchased another product which was a major disappointment, so I was back to the drawing board.The reviews won me over, and free shipping, so I ordered one of each, red and green. Tonight I used the green for the first time and WOW! It made me look like a gourmet international chef - it is so incredibly good!It was definitely hot, though, which is fine with me but I was glad I had the coconut milk base. This is excellent and I will keep this on hand always.", "overall": 5.0, "summary": "OMG! What a treasure find!", "unixReviewTime": 1375488000, "reviewTime": "08 3, 2013"}
{"reviewerID": "A3AMNY44OP8AOU", "asin": "9742356831", "reviewerName": "Jennifer Lee", "helpful": [1, 1], "reviewText": "I started a new diet restricting all added sugars.  This was one of the only brands I could find that didn't have sugar added into the ingredients.  And it tastes great to boot!  I'm not sure I could finish this whole tub before it goes off though.  How long does it last?", "overall": 4.0, "summary": "Tastes great!", "unixReviewTime": 1390435200, "reviewTime": "01 23, 2014"}
{"reviewerID": "A3IB4CQ2QEJLJ8", "asin": "9742356831", "reviewerName": "J. Zack", "helpful": [0, 0], "reviewText": "So many flavors. I can't begin to tell you how much I love all of mae ploy curries. I should ask them for recipes. Basically its a plastic lidded container about the size of I wanna say two and one half yogurts. It has a bag inside that you pull out and inside that clear bag is the curry. Its all mashed in there. I cut a corner and take out  a little at a time. Having the spices mixed and its a paste makes it nicer to make a sauce and marry this flavor to anything. Veggies love it that are steamed, scrambled eggs, rice pasta and even fish and meat.", "overall": 5.0, "summary": "Thai curry is the way to go to add spice to anything", "unixReviewTime": 1398556800, "reviewTime": "04 27, 2014"}
{"reviewerID": "AQA5DF3RWKETQ", "asin": "9742356831", "reviewerName": "LindaE", "helpful": [1, 2], "reviewText": "I've used this a lot recently in some of my chicken dishes. I don't use a lot, I do like spicy foods and a little goes a long way. The plus is its in a bag and you can squeeze out what you need.. Yes I will buy more", "overall": 5.0, "summary": "Thai Green Curry", "unixReviewTime": 1353974400, "reviewTime": "11 27, 2012"}
{"reviewerID": "AOHQ17LGZHTI5", "asin": "9742356831", "reviewerName": "Matthew S.", "helpful": [1, 2], "reviewText": "This is a huge step up in quality from the kind that is normally available in the supermarkets near me. This makes green curry extremely easy. It also appears to have a pretty good shelf life which is good because there's enough in here to make several large portions, so unless you eat green curry all the time it will last quite a while.", "overall": 5.0, "summary": "Make green curry quite easy", "unixReviewTime": 1359072000, "reviewTime": "01 25, 2013"}
{"reviewerID": "AZKRFNQ8EFO4T", "asin": "9742356831", "reviewerName": "Mike Williams", "helpful": [4, 4], "reviewText": "I have two things in mind when I make a Thai curry: 1) I want it to taste good and 2) I want whomever I'm making it for to feel like it's fairly authentic. Mae Ploy makes both of these tasks quite easy to accomplish. The very best curry is made from making one's own paste, however finding the time and perhaps even more difficult, the ingredients to do so does not compensate for the difference in taste. In my experience, Mae Ploy is an excellent green curry paste that tastes plenty fresh and will give you that same satisfaction that you get from a Thai restaurant.A few things I've learned using their curry pastes over the years:1) If you are cooking for people who are not used to Thai food, the proportions indicated in the directions on the container will be WAY TOO HOT for them. This is especially true with Green Curry and even more important if there will be children eating the meal. It's very easy to adjust the amount of paste used, and with practice you'll learn just how much is good for the experienced palate and how much is good for kids or newbies.2) The packaging doesn't mention anything about how long the product keeps. The paste comes in a plastic container with a lid that can seal, but it's actually in a thick plastic bag inside that container. I used to cut open the bag and leave it in the container, but I've taken to just cutting a hole in the corner and using it like an icer would in a bakery. I feel like the double container might help it to keep a bit longer. Once the bag is opened, the product should be stored in the refrigerator. There is enough in the container to make several curry dishes.3) Mae Ploy paste is fantastic, but choosing a bad coconut milk can degrade the quality of your dish or even ruin it altogether. Don't go with \"lite\" brands, and look for something more authentic if you can find it. I've found Chaokoh brand comes with a higher amount of cream which gives your curry a more consistent flavor. Chaokoh is the brand most often found in Asian markets and I've always figured that they would know best.This product is incredibly easy to use and turns out a Green Curry that will make your friends think yours is good as a restaurant's. I don't believe there is a better paste on the market and when you factor in the price it's a no brainer. (FYI,If you live in an area where there are asian markets, you will do better buying it there as it will be even cheaper).", "overall": 5.0, "summary": "Authentic, easy, and delicious!", "unixReviewTime": 1383609600, "reviewTime": "11 5, 2013"}
{"reviewerID": "A1Z7Y2GMAP9SRY", "asin": "9742356831", "reviewerName": "M. Thompson \"Dyson Diva\"", "helpful": [0, 0], "reviewText": "I like to make my own curry but this is a tasty alternative.  I use it as a base for all kinds of different curry recipes.", "overall": 5.0, "summary": "Yum!", "unixReviewTime": 1403827200, "reviewTime": "06 27, 2014"}
{"reviewerID": "ANDN9BU8C5XWN", "asin": "9742356831", "reviewerName": "Noell Rose", "helpful": [0, 1], "reviewText": "Because of Mae Ploy Thai Green Curry Paste, green thai curry has become my signature dish. I am always being asked to make it. Remember that it is very spicy so a little goes a long way. The flavors in this paste are complex and varied and make for a delicious curry. We are living overseas (not in Thailand) so I am happy to see that it is available on Amazon!", "overall": 5.0, "summary": "My new signature dish!", "unixReviewTime": 1344038400, "reviewTime": "08 4, 2012"}
{"reviewerID": "A3QUNDGB1QJ1IF", "asin": "9742356831", "reviewerName": "R. Myers", "helpful": [1, 2], "reviewText": "Hadn't had green curry before so I bought this to give it a try.  Turned out really good and I loved the heat level I got using 2 Tbs of paste.  I ordered the red paste too but haven't gotten to try it yet, but if it's as good at this paste it should be way better than what my grocery store carries.", "overall": 4.0, "summary": "Really good", "unixReviewTime": 1355702400, "reviewTime": "12 17, 2012"}
{"reviewerID": "AWX83GL66IKBC", "asin": "9742356831", "reviewerName": "serioushopper \"Ely\"", "helpful": [0, 0], "reviewText": "Being newbie to THai cooking, these are great addition to my kitchen. Its tastes really good for vegetable and chicken curry.", "overall": 5.0, "summary": "Taste great", "unixReviewTime": 1369785600, "reviewTime": "05 29, 2013"}
{"reviewerID": "A3TGHJJ3ZE8KCH", "asin": "9742356831", "reviewerName": "S. Thornton \"Tea Freak\"", "helpful": [1, 1], "reviewText": "I have tried all the curris from Mae Ploy (excluding the Panag) and various other curry pastes out there. Mae Play is a solid and affordable curry paste that keeps. The Red has more heat, but the green has more spice. The Yellow and Matsaman curry paste don't really have any heat to me, but do taste good as well.For a holiday treat, substitute eggnog for coconut milk with the green curry. It is super delicious (just be advised your GI tract WILL hate you later for doing so)", "overall": 5.0, "summary": "Delicious", "unixReviewTime": 1387670400, "reviewTime": "12 22, 2013"}
{"reviewerID": "A2PUSR7ROG0Z6T", "asin": "9742356831", "reviewerName": "Terry Bisgrove \"Mr.E.Man\"", "helpful": [2, 2], "reviewText": "I like other styles of Mae Ploy curry paste, but the green just doesn't work for me. Overwhelming garlic, no heat, and very bland. I would not purchase this product again.", "overall": 3.0, "summary": "OK Product", "unixReviewTime": 1344297600, "reviewTime": "08 7, 2012"}
{"reviewerID": "A2ANBEX40KLY4O", "asin": "9742356831", "reviewerName": "TrishS \"TrishS\"", "helpful": [3, 4], "reviewText": "I have both the red and green curry paste.  The green is milder.  I use both of them in variety of dishes and often spice up soups and stews that need a little zing.  It is so convient to have them in the frig.", "overall": 5.0, "summary": "Tasty and fast", "unixReviewTime": 1310601600, "reviewTime": "07 14, 2011"}
{"reviewerID": "A1C8NAHYR6Z10F", "asin": "B00004S1C5", "reviewerName": "A. Horikawa", "helpful": [1, 2], "reviewText": "These dyes create awesome colors for kids crafts. I have used them to make finger paint, paint, play dough, and salt dough.Another reviewer stated that they are not natural - this is CORRECT. They are definitely artificial dyes. I tried making my own dyes, and when that fell through, these worked great in a pinch. You only need a couple drops for really vibrant color. And they are pretty easy to clean - don't stain after they've been made into whatever craft.Good product for the price!", "overall": 5.0, "summary": "Great for kids crafts!", "unixReviewTime": 1344297600, "reviewTime": "08 7, 2012"}
{"reviewerID": "A14YSMLYLJEMET", "asin": "B00004S1C5", "reviewerName": "Amazon Customer", "helpful": [8, 11], "reviewText": "This product is no where near natural / organic-I only wish I had seen the other reviews before purchasing! It contains all the things I did not want-which is why I was looking for a natural alternative. They need to have an ingredient list on here to avoid this...I am &#34;returning&#34; item. I am trying to avoid my children's exposure to yellow 5, red 40 and so on...I do not understand how they can still make these things knowing what they can cause. This may be fine for someone that doesn't read labels or care what their kids eat-but not for my family.", "overall": 1.0, "summary": "Not natural/organic at all", "unixReviewTime": 1364515200, "reviewTime": "03 29, 2013"}
{"reviewerID": "A1358PQON9ZAK4", "asin": "B00004S1C5", "reviewerName": "lj", "helpful": [0, 0], "reviewText": "Used for making red and green caramel corn for Christmas. Wasn't sure how the food coloring would work with the caramel, but these created great, vibrant colors. (They did darken a little after baking the caramel corn, but were still fairly bright.)Great product and will last me a long time.", "overall": 5.0, "summary": "Only tested red and green, but did they worked great!", "unixReviewTime": 1369353600, "reviewTime": "05 24, 2013"}
{"reviewerID": "ARTSSZHO3ZYYR", "asin": "B00004S1C5", "reviewerName": "R. Billings", "helpful": [0, 0], "reviewText": "This is a nice basic selection of gel food colorings which you can make all the basic colors you would need for a beginner.  They mix well with frostings and do not make the frosting runny as with liquid colors.", "overall": 5.0, "summary": "gel food coloring kit", "unixReviewTime": 1329782400, "reviewTime": "02 21, 2012"}
{"reviewerID": "A1KXONFPU2XQ5K", "asin": "B00004S1C5", "reviewerName": "Stephanie Manley", "helpful": [9, 10], "reviewText": "This are so much easier to use than the Wilson paste colors.  Colors are  vibrant, and do not taint the frosting like some colors can.  These are  simple to use, and do not make a mess.  My only complaint is that I did not  find these years ago.  This is a must have if you decorate often!", "overall": 5.0, "summary": "Very easy to use", "unixReviewTime": 965779200, "reviewTime": "08 9, 2000"}
{"reviewerID": "A243WY7KPVWA8S", "asin": "B00004S1C5", "reviewerName": "Wendy S. Pagot", "helpful": [1, 1], "reviewText": "If you are looking for deep saturated colors, these are the ones for you. I had to use more than I expected while coloring white fondant but the colors were nice and bright and the farm cake turned out beautiful! Caution, wear gloves as these will stain your hands.", "overall": 4.0, "summary": "Good rich colors!", "unixReviewTime": 1365206400, "reviewTime": "04 6, 2013"}
{"reviewerID": "A12BTR2MVK2BR5", "asin": "B00004S1C5", "reviewerName": "xenofan", "helpful": [0, 0], "reviewText": "My only complaint about this product is that sometimes it is difficult to squeeze just a very small amount from the bottle into the mixture to be colored.  I don't do massive amounts of baking, and I find that sometimes it is really hard to get a very light color when adding this product to very small quantities of mixture.  However, the colors are very bright and I was very pleased to find that the color is evenly distributed throughout the mixture.  I thought this product was a little pricy, but after trying it out, I do believe that it was worth the extra money.  The product seems of high quality and it shows in my cooking whenever I want to add some color to things.", "overall": 4.0, "summary": "Very happy", "unixReviewTime": 1289865600, "reviewTime": "11 16, 2010"}
{"reviewerID": "ATN5X2PM7OB3K", "asin": "B0000531B7", "reviewerName": "Danny Mack", "helpful": [0, 0], "reviewText": "I really enjoy these bars as a quick breakfast, lunch, or pre-workout snack.  I need something quick in the mornings and this does the trick.  They fill me up better than other bars on the market and I am a big fan of the taste.  I do eat alot of different meal and energy bars over the course of the week but I think these are my favorite.  I have been using subscribe and save for several shipments and I have never had a problem with old or stale items.  And Amazon seems to be much cheaper than buying individual bars at the grocery store.", "overall": 5.0, "summary": "I really enjoy these bars as a quick breakfast", "unixReviewTime": 1404172800, "reviewTime": "07 1, 2014"}
{"reviewerID": "A2BYV7S1QP2YIG", "asin": "B0000531B7", "reviewerName": "Dr. Oceanfront \"Oceanfront\"", "helpful": [1, 1], "reviewText": "Frankly, I was worried about buying these on line because I have heard stories about getting expired food. However, these came in and were very fresh, so I am happy and would buy again.The taste is good. But more importantly they are very filling, especially is you eat it with a full glass or water.This is one of the most healthy bars available.", "overall": 5.0, "summary": "Good, filling bar...", "unixReviewTime": 1397088000, "reviewTime": "04 10, 2014"}
{"reviewerID": "A2TN9C5E4A0I3F", "asin": "B0000531B7", "reviewerName": "Jimmy", "helpful": [2, 4], "reviewText": "It's unfortunate that energy bars are shrinking, you have to eat two to feel like you ate anything.  This one wasn't that impressive.  Tasted to me like oats and raisins with side of peanut flavor.  High carb and not that high of content of anything good..basically a glorified, healthier granola bar.  Not worth the price in my opinion and I won't be repurchasing.  I've had much better.", "overall": 3.0, "summary": "Small and not that great", "unixReviewTime": 1309737600, "reviewTime": "07 4, 2011"}
{"reviewerID": "A1X1CEGHTHMBL1", "asin": "B0000531B7", "reviewerName": "jjceo", "helpful": [0, 0], "reviewText": "I have to watch what I eat as I am diabetic.  As a result I can experience low blood sugars especially when I do a lot of yard work, exercise a lot or ride my bike.  I always carry one of these with me as an emergency booster to make sure that I have the energy to continue or to raise my blood sugar when I need it.We tried many types of energy bars and to me so many tasted like cardboard.  If it doesn't taste good then why eat it?  To me this is the best energy bar that I have tried and I like that it is helping me while I enjoy eating it.  They do contain a lot of calories and sugar so I only use them when I really need to have the boost.  I also carried them when I used to travel all of the time and I got off schedule with my meals because of time zones and long flights.Nutrition data for the oatmeal raisin cookie flavor:* Calories 250* Calories from fat* Total fat 5 grams* Saturated fat 2 grams* Trans fat 0* Cholesterol 0* Sodium 140 mg* Potassium 200 mg* Total carbohydrates 43 grams* Dietary fiber 5 grams* Sugars 22 grams* Protein 10 grams* It also includes Vitamins C and B6, calcium, iron thiamin and riboflavin.* I wish that foods sold online always posted the nutrition labels and the ingredients so you could check for allergies and sugars.The only down side for me is that if I am bike riding for example and it gets hot then the icing coating on the bottom gets soft and can be messy so I just eat them out of the wrapper.  I still like them and I use them all the time when I need the boost.  This is a good product and I recommend it.", "overall": 5.0, "summary": "Helpful nutrition when you need it for that power or sugar boost!", "unixReviewTime": 1343433600, "reviewTime": "07 28, 2012"}
{"reviewerID": "A1SYLII0808HD6", "asin": "B0000531B7", "reviewerName": "M. Allen Greenbaum", "helpful": [30, 34], "reviewText": "I make no claims to sports nutrition (or any nutrition for that matter)expertise, so I'll just call it a snack, and leave its place in your exercise program between you and your personal doctor/nutritionist/coach/guru. However, I will say that this is a much better than average tasting sports bar/snack (name your preference), free of the cardboad-ish and stale texture and barely identifiable aftertastes common to similar products.While noone will compare this to a real apple crisp, this convenient food for those on the go has recognizable tastes of oats (this flavor and texture predominates), apple, and cinnamon, due in large part, I suspect, to the fact that it actually contains those ingredients! There are also raisins, cane and other sugars--including fructose from fruit juices-- giving it a sweet but not cloying (as they say at the wineries) taste. This company is known for its quality ingredients and generally consumer-friendly face; you can read more about them at powerbar.com. The company recommends consuming this with water to aid the absorption of the many added nutrients--this also gives one a more \"full\" feeling. One of the better tasting snacks of this type; I've listed nutritional information and ingredients (from the web site) below.Nutritional Information:*Percent Daily Values (DV) are based on a 2,000 calorie diet.In one Serving Size (One Bar; total=65 grams), there are 240 calories and 35 calories from fat 35 (6% of DV). Total Fat=4grams (g) (6% of DV), which includes  0.5 grams of Saturated Fat (3%)and 0 g (as in none) Trans Fat. No Cholesterol and 140 mg of sodium (6%). Total Carbohydrates = 42g (14%), of which fiber is 5g (20%), and sugars, 20g. (Does anyone carbo-load anymore?).  Protein 10g (16%)Vitamins and Minerals:Vitamin A (20%), Vitamin C (80%), Calcium (40%), Iron (25%),  Vitamin E (80%), Thiamin (40%), Riboflavin (40%), Niacin (40%), Vitamin B6 (40%), Folate (80%  Vitamin B12 (80%), Biotin (40%), Pantothenic Acid (80%), Phosphorus (20%  Magnesium (20%), Zinc (20%), Copper (20%), Chromium (20%), Vitamin K (20%), Iodine (20%), Manganese (20%), Molybdenum (20%), Selenium (20%),Ingredients:Whole Oats, Brown Rice Syrup, Rice Crisps (Milled Rice, Sugar, Salt, Barley Malt), Dried Apples, Evaporated Cane Juice Syrup, Raisins, Roasted Soy Beans, Almond Butter, Honey, Pear and Grape Juice Concentrate, Brown Rice Flour, Soy Protein Isolate, Glycerin, Natural Flavors, Cinnamon, Nonfat Milk.Possible Allergens: Contains milk, nut and soy ingredients. Made on equipment that also processed peanuts and wheat.Salud!", "overall": 5.0, "summary": "4 1/2  A Apple Crisp A Day Does...Something for You", "unixReviewTime": 1141430400, "reviewTime": "03 4, 2006"}
{"reviewerID": "A3T0OTH5072YRE", "asin": "B0000531B7", "reviewerName": "M. Reynard \"kairosdreaming\"", "helpful": [0, 0], "reviewText": "This was actually a really good bar.  I enjoyed the flavor and it managed to fill me up in place of a regular breakfast.  I didn't get hungry until at least three hours later (and for me that is actually pretty good, I'm always hungry).The main flavor of this bar was the peanut butter. The chocolate barely made an appearance and that was just fine for me.  It was just a surprise here and there when you hit a chip.  The bar was chewy, but not really crunchy from the oats and other grains and fibers that were included in the bar.  It was sweet, and that's to be expected from the sweeteners of brown rice syrup, honey, evaporated can juice syrup and the chocolate chips.  Lots of sweeteners in here making the bar content of sugar 18 grams.  So that is something to watch.The rest of the ingredients were good.  There's whole oats, rice flour, and other pronounceable ingredients throughout.  And a whole list of minerals and vitamins is included so it's even somewhat nutritional for you.  But there are a lot of allergens here as well, as is obvious by the peanut butter flavor.  And another thing of note is that this bar packs a walloping 240 calories.  So use it as a meal replacement or for during vigorous exercise as opposed to a snack.  It would definitely be a good bar for a hiking trip.I liked it and will probably consider it again for breakfast.  It kept me full and I liked the taste, and it will have inspired me to try other PowerBar flavors as well.Review by M. Reynard 2012", "overall": 4.0, "summary": "Powerbar Harvest Peanut Butter Chocolate Chip Bar", "unixReviewTime": 1335484800, "reviewTime": "04 27, 2012"}
{"reviewerID": "A3MLKJ1HHA2SX0", "asin": "B0000531B7", "reviewerName": "Robert L. Stinnett", "helpful": [5, 6], "reviewText": "If you are a fan of peanut butter and chocolate, than this bar is for you.  I've tried a number of energy bars and they all suffer from one problem -- bland taste and usually end up leaving a gritty aftertaste in my mouth.  Not so with PowerBar.I make a PowerBar part of my regular morning routine.  After trying a few of the other flavors I finally stumbled upon the peanut butter and chocolate chip and was \"hooked\".  The flavor is just right and the crispness of the bar is not too hard, but firm enough to make you \"feel\" like you are eating a full meal.  One bar will usually kill any cravings I have all throughout the morning.", "overall": 5.0, "summary": "Best Energy Bar Out There", "unixReviewTime": 1162598400, "reviewTime": "11 4, 2006"}
{"reviewerID": "A3D21GURDGTS0J", "asin": "B0000531B7", "reviewerName": "sess882", "helpful": [0, 0], "reviewText": "Love these things before a work out, they provide some good energy to push me through.  The crisp powerbars are my favorite, they really don't have that chalky kind of after taste to them like some other energy bars.", "overall": 5.0, "summary": "powerbar", "unixReviewTime": 1378512000, "reviewTime": "09 7, 2013"}
{"reviewerID": "A2DFKLX2YGJ67P", "asin": "B0000531B7", "reviewerName": "Shanna Grimaldi \"Shanna Grimaldi\"", "helpful": [0, 0], "reviewText": "There's a vague taste of apple cinnamon, but mostly I taste oats. I do love that these fill me up and keep me full for awhile. They are exactly what I needed.", "overall": 4.0, "summary": "They work well enough.", "unixReviewTime": 1399680000, "reviewTime": "05 10, 2014"}
{"reviewerID": "A3EBHHCZO6V2A4", "asin": "B00005344V", "reviewerName": "Amaranth \"music fan\"", "helpful": [12, 12], "reviewText": "Traditional Medicinals' \"Breathe Easy\" is an amazing tea. A couple of times I've had asthma attacks, it's clearing powers have worked! It's a delicious,spicy mix of Egyptian licorice, peppermint, ginger, and eucalyptus. It's the drinkable Vaposteam&its benefits are incredible. Traditional Medicinals is based in beautiful Sebastopol, California, and its healing herbs come from their garden!", "overall": 5.0, "summary": "Learning to Exhale", "unixReviewTime": 1203465600, "reviewTime": "02 20, 2008"}
{"reviewerID": "A1P9UMP1XSE6MI", "asin": "B00005344V", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I bought this to compare it against Yogi Tea's &#34;Breathe Deep&#34; tea because of the lower cost.  It's pleasant enough but I prefer the Yogi Tea better.  This brand tastes good but seems to be less effective in clearing a cough or congestion than Yogi Tea.", "overall": 3.0, "summary": "Good tea", "unixReviewTime": 1395014400, "reviewTime": "03 17, 2014"}
{"reviewerID": "A2F488C4PLWGEI", "asin": "B00005344V", "reviewerName": "Gandalphar", "helpful": [0, 0], "reviewText": "If my wife drinks a cup of this tea when she feels an attack coming on it often helps her avoid the attack at all. If we are out and she has an attack drinking this tea has lessened the effects and helped her recover more quickly.We have tried other tinctures and teas but his blend from TM has been wonderful! It tastes great (I enjoy it  myself) and it is an effective breathing aid.**of course this is not medical advice, this N1 experience.", "overall": 5.0, "summary": "Lessens the effects of an asthma attack", "unixReviewTime": 1395532800, "reviewTime": "03 23, 2014"}
{"reviewerID": "AO1HXV7DWZZIR", "asin": "B00005344V", "reviewerName": "Larry Jaques \"an avid reader\"", "helpful": [2, 2], "reviewText": "I don't know about the medicinal aspects of this tea, but the flavor is downright scrumptious.  I love licorice root but have high blood pressure, so I'm not guzzling down box after box each week.  A few cups a week doesn't touch my BP, so I keep it to that.  The directions say to steep it for 10-15 minutes, but I'm far too impatient for that.  4-6 minutes is all I can wait after smelling that lovely aroma.  Traditional Medicinals puts out some really good teas.  I just wish they weren't so proud of 'em.  ChaChing!  Thanks, TM. Now try to work on that pricing for us, will ya?  Danke.", "overall": 5.0, "summary": "Tasty Medicine", "unixReviewTime": 1391644800, "reviewTime": "02 6, 2014"}
{"reviewerID": "A1WSALRW89YKFA", "asin": "B00005344V", "reviewerName": "Liz Jolie", "helpful": [2, 2], "reviewText": "The taste of the breathe easy was ok, a little on the earthy side. I did find it cleared my lungs. However, I am prone to migraines and this set off a big one. I had to toss the 6 boxes I bought, ugh.", "overall": 3.0, "summary": "Mixed thoughts", "unixReviewTime": 1394409600, "reviewTime": "03 10, 2014"}
{"reviewerID": "A1DDBAUTVIVHD3", "asin": "B00005344V", "reviewerName": "sonia macdonald", "helpful": [0, 0], "reviewText": "I had TB when I lived in Mexico in l970/71/72.  I used eucalyptus/licorice tea and actually cured myself.  Since that time, I have used this tea every day as I love the taste of it.  I recommend it to anyone who wants to strengthen their lungs.", "overall": 5.0, "summary": "Can't live without it.", "unixReviewTime": 1356480000, "reviewTime": "12 26, 2012"}
{"reviewerID": "A1J52MX2YDWSU0", "asin": "B00005344V", "reviewerName": "these pretzels r making me thirsty", "helpful": [1, 2], "reviewText": "Traditional Medicinals is the best tasting herbal tea out there that I have tried. I have tried the Yogi teas before and did not care for them. I bought the Traditionals Breathe Easy and the Gypsy Cold Care. I take the breathe easy whenever I feel congested or like now when I had a coughing attack from some scent. My throat felt irritated and my chest felt achey and wheezy. Brewed a cup of this tea with some honey and it was so delicious and soothing. I don't know if its the way it makes you feel when you drink it because it tastes so good, or if the herbs really do help but I do feel better, a sense of calm. I highly recommend the Breathe Easy and the Gypsy Cold Care.", "overall": 5.0, "summary": "Delicious", "unixReviewTime": 1295568000, "reviewTime": "01 21, 2011"}
{"reviewerID": "A2GA55P7WGHJCP", "asin": "B0000537AF", "reviewerName": "amazon shopper", "helpful": [2, 2], "reviewText": "I really enjoy PowerBar ProteinPlus bars - but rarely buy them except when they are on sale. Purchasing them through Amazon is like having a sale everyday. I used the subscription for these PowerBars and reduced the cost even more. I have also purchased 2 other flavors.  The Toffee Nut arrived the quickest. I have many food sensitivities, and these products do not trigger them.  I feel vey happy to have them.", "overall": 5.0, "summary": "Dark Chocolate Toffee Nut - fantastic flavor! Great Amazon prices", "unixReviewTime": 1295481600, "reviewTime": "01 20, 2011"}
{"reviewerID": "A3M174IC0VXOS2", "asin": "B0000537AF", "reviewerName": "Gail Cooke", "helpful": [2, 3], "reviewText": "Everyone needs an extra boost of energy after exercise, and this good tasting bar provides just that.All the necessary nutrients are there to give you the lift you need.It is helpful to drink a tall glass of water along with it.", "overall": 5.0, "summary": "TASTES GOOD AND IS GOOD FOR YOU", "unixReviewTime": 1075593600, "reviewTime": "02 1, 2004"}
{"reviewerID": "A3094EPI56GKZ6", "asin": "B0000537AF", "reviewerName": "Kristen E. Bogren \"Kristen Bogren\"", "helpful": [2, 2], "reviewText": "I wanted some extra protein for my workouts. Saw these on a gold box special at a great price and I bought them. I really don't like the taste, compared to other high protein bars I have tried, but they had great nutritional benefits. I would not buy these again though, due to the taste for me.", "overall": 3.0, "summary": "Not very tasty, but good protein content", "unixReviewTime": 1248566400, "reviewTime": "07 26, 2009"}
{"reviewerID": "A16VZ70X9X0TQ0", "asin": "B0000537AF", "reviewerName": "S. Frazier", "helpful": [0, 0], "reviewText": "I have added one of these to my morning routine.  I used to just drink a quart of water for breakfast,(over about an hour and a half).  I started eating one of these along with the water and I feel more energetic while getting ready for work.  I buy three boxes ervery two months using the subscription method.  Amazon sends a heads up email to you before shipping the subscribed items alowing you to add to or stop any shipments at your leisure.", "overall": 5.0, "summary": "Great quick source of nutrition", "unixReviewTime": 1290384000, "reviewTime": "11 22, 2010"}
{"reviewerID": "A2B7BUH8834Y6M", "asin": "B0000537AF", "reviewerName": "Shelley Gammon \"Geek\"", "helpful": [1, 1], "reviewText": "I love having one of these in my backpack or purse as a back-up pick-me up that isn't overloaded with sugar, sodium or artificial sweeteners. I'm deathly allergic to Splenda (secretly added to many things today under the chemical name of sucralose), so I always check labels. Most energy bars are not high enough in protein, or are either overly sweet, overly salty or worse - overly bland. I don't have the sensation that I'm eating cardboard covered in flavoring. Unlike a lot of protein bars out there, I really have a sensation of being full after having one, instead of trying to find something else to snack on. I'm one of those rare birds that hates chocolate, so it's hard enough to find an option that is not dripping in the brown stuff. Rest assured, chocolate lovers, PowerBar does make chocolate flavored bars - but I very much appreciate having the vanilla yogurt bar as an option for protein. It isn't overly crunchy, so I don't get flecks of particles all over my shirt when I grab one on the go - and I don't get stuff stuck between my teeth eating these, either - so it's safe to have before a staff meeting.", "overall": 5.0, "summary": "My favorite protein bar", "unixReviewTime": 1341273600, "reviewTime": "07 3, 2012"}
{"reviewerID": "A3NEAETOSXDBOM", "asin": "B0000537AF", "reviewerName": "Stephen M. Charme", "helpful": [1, 1], "reviewText": "I am a runner and discovered this in a grocery store when I was at the four mile mark of a ten mile run and stopped for some water. This tastes great, and gives me plenty of energy when I run or work out in the gym. I also keep this at work for a snack.", "overall": 5.0, "summary": "Tastes great and gives energy", "unixReviewTime": 1219622400, "reviewTime": "08 25, 2008"}
{"reviewerID": "A2BB4DGBRVGKWW", "asin": "B00005C2M2", "reviewerName": "A Customer \"customer12345657\"", "helpful": [1, 2], "reviewText": "This is awesome.  It tastes like the fake marshmallows they put in immoral breakfast cereal, but instead of just tasting like sugar it tastes like fat as well.  I can't believe I never tried this stuff until now, but I am definitely going to keep a stack of these in my desk.Disclosure:1. Your block of \"ice cream\" WILL be broken into a bunch of smaller chunks.  It is so brittle that they probably all end up like that (this was the first one I ate, but one reason I passed on this stuff so many times is because I could tell by picking up the package that they were always broken).2. Partly for the above reason, astronauts don't actually eat this stuff any more.  Wikipedia says it was used on one mission and was found to be inconvenient.  Also, they have a freezer on the space station and just eat real ice cream.In spite of those facts, this stuff is delicious.", "overall": 5.0, "summary": "Mmmmmmmm", "unixReviewTime": 1351987200, "reviewTime": "11 4, 2012"}
{"reviewerID": "A14Z6D3IRJ23F7", "asin": "B00005C2M2", "reviewerName": "Chris F \"root\"", "helpful": [0, 0], "reviewText": "I bought these for a lightweight backpacking snack. From what I remembered as a kid they are very tasty, and I was not disappointed! I've read other reviews complain about they come broken apart - but that's normal/acceptable - it in no way effects the quality of this product. The packaging of this is bulky - almost 0.4oz per! Luckily this product stays fresh in just a ziplock bag for at least a week. I put most of these in a gallon ziplock and saved several ounces in weight over ditching the stock packaging material. Gave some to my son and he loved them as well - they make a great/unique gift to kids.", "overall": 5.0, "summary": "Awesome light weigh snack!", "unixReviewTime": 1346112000, "reviewTime": "08 28, 2012"}
{"reviewerID": "A1PQJBRZLS0ZWY", "asin": "B00005C2M2", "reviewerName": "D. Kaiser \"Myke xlong\"", "helpful": [0, 0], "reviewText": "i have been eating this stuff since i was a kid and i am in love with it.  it is soooo good and pretty cheap when you buy it on amazon.", "overall": 5.0, "summary": "best stuff in the world", "unixReviewTime": 1358726400, "reviewTime": "01 21, 2013"}
{"reviewerID": "A1CJY7C4CVUG6X", "asin": "B00005C2M2", "reviewerName": "Matt", "helpful": [0, 0], "reviewText": "I was born in the 80's, and this was brought into class a few times. This is very good stuff, and is exactly how I remember it. It is however expensive. I ate the 10 pack within a day or two. I bought this to try out for long term food storage. They will last only a few years, which is expected because it's a dairy product.Definitely a comfort food, I will be stocking up more. LOVE IT", "overall": 5.0, "summary": "Nostalgia", "unixReviewTime": 1357603200, "reviewTime": "01 8, 2013"}
{"reviewerID": "AR1QBYXDIN6ZC", "asin": "B00005C2M2", "reviewerName": "rusty shackleford", "helpful": [0, 0], "reviewText": "This is one of my favorite desserts, and melts quickly in the mouth. This brand is good and it shipped well-packaged. Everyone should try this once. The amazon price is much better than the ones you find at science fairs.", "overall": 5.0, "summary": "Awesome", "unixReviewTime": 1359331200, "reviewTime": "01 28, 2013"}
{"reviewerID": "A3ECE51AG6ZK4B", "asin": "B00005C2M2", "reviewerName": "Seadreamer \"Seadreamer\"", "helpful": [8, 9], "reviewText": "my niece teaches underprivileged kids in florida --- she had a science lesson and i sent her 3 boxes of this stuff --- most of the kids would never in their lives have had a chance to taste this stuff --- so for the price it was a good deal to share something that these kids would never have had...", "overall": 5.0, "summary": "great", "unixReviewTime": 1315699200, "reviewTime": "09 11, 2011"}
{"reviewerID": "A3OFJES10PZGEH", "asin": "B00005C2M2", "reviewerName": "SN", "helpful": [0, 0], "reviewText": "It's cracked to pieces on purpose so it's easier to eat.  It's a bit sweeter than regular ice cream because there's no water.  Convenient to take with you anywhere!  This brand contains NO High Fructose Corn Syrup so it's healthier. Great deal! $19.95 ordered on 8/3/2011.", "overall": 5.0, "summary": "Great Taste! Convenient! Sweet!", "unixReviewTime": 1312848000, "reviewTime": "08 9, 2011"}
{"reviewerID": "A2KP45DO3RY4RG", "asin": "B00006IUTN", "reviewerName": "CheeryToes", "helpful": [2, 3], "reviewText": "I'm not sure why everyone says they are using this thing with their Brew n Go's...it's tiny! I'm not sure what it is supposed to fit - but it's itty bitty! It does keep my 3 scoops of coffee in place, so I'm going to use them - but keep in mind this is WAY smaller than you think it's going to be! When they are gone, 480 cups of coffee from now - I'll be going back to my #2 filters.", "overall": 5.0, "summary": "NOT FOR BREW N GO!!!", "unixReviewTime": 1217548800, "reviewTime": "08 1, 2008"}
{"reviewerID": "A35N0EICBY7X8J", "asin": "B00006IUTN", "reviewerName": "CynBio", "helpful": [3, 4], "reviewText": "These fit the Brew N' Go well, but could stand to be a little bit taller.  I like to use a lot of fairly coarsely ground coffee to make a cup, which means that my minimum volume of grounds is the maximum this filter can carry.  Another half inch or even an inch would make a huge difference - there's certainly space in the coffee maker for it!If you're a normal coffee drinker, though, using fewer, finer grounds, this is an excellent choice for you.", "overall": 4.0, "summary": "Good for Brew N' Go", "unixReviewTime": 1263340800, "reviewTime": "01 13, 2010"}
{"reviewerID": "A2UOHALGF2X77Q", "asin": "B00006IUTN", "reviewerName": "D. Hentze", "helpful": [0, 0], "reviewText": "I've been using \"Melitta Cone Coffee Filters, Natural Brown, No. 1\" for years with myBlack & Decker DCM18S Brew 'n Go Personal Coffeemaker with Travel Mug, but I can no longer find them at any of my local stores. Luckily I found them by the case at Amazon for much less than what I was paying for them at the store. I now have enough filters to last me at least 2 years. These filters fit my 1 cup Black and Decker coffee maker perfectly, and do a much better job filtering the coffee than the permanent filter that comes with it. Another supposed benefit is that paper coffee filters trap oily substances in coffee called \"diterpenes\", which are said to raise your cholesterol levels, and are not filtered out if you use the permanent mesh filter.  I highly recommend using the \"Melitta Cone Coffee Filters, Natural Brown, No. 1\".", "overall": 5.0, "summary": "Improvement over the permanent filter.", "unixReviewTime": 1379721600, "reviewTime": "09 21, 2013"}
{"reviewerID": "A37USOKUTI724H", "asin": "B00006IUTN", "reviewerName": "Donna Capshaw \"Grandma\"", "helpful": [1, 1], "reviewText": "This filter fits right into my one cup Black and Decker. Even though my coffee maker came with a \"permanant\" filter this ensures that there are no grounds in each perfect cup of coffee. I will purchase again.", "overall": 5.0, "summary": "Just Right!", "unixReviewTime": 1211587200, "reviewTime": "05 24, 2008"}
{"reviewerID": "A3EW235III93CP", "asin": "B00006IUTN", "reviewerName": "ivy", "helpful": [0, 0], "reviewText": "No. 1 One Cup Coffee Filters:  Received 40 filters to the case, 12 to a box.  The filters fit perfectly into the Black and Decker one cup coffee maker sold by Amazon. No problems with loose coffee grinds spilling over into the coffee maker.  Makes for quick and easy clean-up.  Just wait until cool enough to remove and drop into the trash.", "overall": 5.0, "summary": "Perfect Filters", "unixReviewTime": 1328486400, "reviewTime": "02 6, 2012"}
{"reviewerID": "A2D1OUM1P2SK4M", "asin": "B00006IUTN", "reviewerName": "joan", "helpful": [0, 0], "reviewText": "These filters fit nicely inside my individual-sized ceramic beverage strainer.  Placed atop a coffee mug or teacup, the filter enables me to make coffee, or tea, minus coffee grounds or tea leaves in the end product!  Simply place the ground coffee or loose tea inside the filter, and pour in boiling water to fill the mug/cup.  Alternatively, if are serving a group, coffee can be prepared in a percolator & loose tea in a teapot...then, poured through filters into individual cups to remove any grounds/tealeaves. I became unable to locate the smaller sizes of these filters (such as this #1) in local retail stores years ago--and was thrilled to discover that Amazon could supply them.", "overall": 5.0, "summary": "Small Melitta Cone Filters", "unixReviewTime": 1372118400, "reviewTime": "06 25, 2013"}
{"reviewerID": "AAMZ09K0S95S7", "asin": "B00006IUTN", "reviewerName": "Kellie Collins \"Kellie Collins\"", "helpful": [0, 0], "reviewText": "When the local grocers stopped carrying these, I was relieved that Melitta still shows them available on their website &#8211; and very happy that Amazon sells them in bulk (12 boxes of 40 each).  I still keep an eye out when I pass the coffee aisle in grocery stores, and no one stocks them anymore.  Not sure why, as they seem to be a hit with folks who use single-serve coffee makers.", "overall": 5.0, "summary": "Great product &#8211; impossible to find locally", "unixReviewTime": 1397606400, "reviewTime": "04 16, 2014"}
{"reviewerID": "A3J0YC2H03U0NG", "asin": "B00006IUTN", "reviewerName": "Sarita M.", "helpful": [0, 0], "reviewText": "I like anything Melitta. Even the name &#34;Melitta&#34; is pretty, though I will hold off naming my first-born &#34;Melitta,&#34; as tempting as it might be. Bought these for my vintage Melitta coffeemaker, so - of course - they're a perfect fit. Bought in bulk, they're at a good price.", "overall": 4.0, "summary": "Melitta", "unixReviewTime": 1362700800, "reviewTime": "03 8, 2013"}
{"reviewerID": "A3OH4OZFZGEH75", "asin": "B0000CCZYY", "reviewerName": "Amazon Customer", "helpful": [1, 4], "reviewText": "Licorice is my favorite candy, and it promotes good digestion. Since I have some digestive issues, I eat licorice on a regular basis. I've tried basically every brand. I bought this because it's advertised as soft licorice. However, it is the same consistency as the cheapest stuff on the grocery store shelf; the difference is that this has a stronger flavor. The flavor is nice. The consistency and texture is terrible. I bought another package hoping the first was just old/stale, but the next package was the same. I threw away both packages.", "overall": 1.0, "summary": "Not soft at all. Basically same as cheap licorice but with stronger flavor.", "unixReviewTime": 1365120000, "reviewTime": "04 5, 2013"}
{"reviewerID": "A3CT06MCFIMAYE", "asin": "B0000CCZYY", "reviewerName": "C. Gray", "helpful": [1, 1], "reviewText": "Nice and soft, super licorice flavor.  I love licorice and have since I was a kid.  This Panda product is very good licorice.", "overall": 5.0, "summary": "Delicious authentic licorice", "unixReviewTime": 1371427200, "reviewTime": "06 17, 2013"}
{"reviewerID": "A1LACH6MLQWZ", "asin": "B0000CCZYY", "reviewerName": "Doug Erlandson", "helpful": [1, 2], "reviewText": "These soft licorice bites from Panda are not as soft as the &#34;soft-eating licorice&#34; from Down Under but are what I would describe as soft but chewy. They are truly &#34;all natural&#34; and have a minimum of ingredients&#8211;&#8211;molasses, wheat flour, licorice extract, and natural flavor (aniseed oil). Nothing more than that. They have a slightly grainy texture, which comes from the use of wheat flour. They also have a strong, traditional licorice taste, which make them ideal for a person with a craving for genuine licorice.", "overall": 5.0, "summary": "Excellent and healthful", "unixReviewTime": 1399075200, "reviewTime": "05 3, 2014"}
{"reviewerID": "ADS5APY1NKTL4", "asin": "B0000CCZYY", "reviewerName": "D. Pawl \"Dani\"", "helpful": [0, 0], "reviewText": "I will come clean to you, here and now, and admit that I do have ONE addiction.  That addiction is this totally wonderful Panda licorice.  For starters, it isn't too sweet. Secondly, it is made with anise oil and has a wonderful flavor.  Plus, the blurb on the side of the box is right.  Licorice does have mellowing properties and helps with digestion, and I also notice that I feel less stressed after I eat it.  [Or is this purely psychological?]  It's wonderful for those days when you are craving a treat, but don't want to feel guilty afterwards.  It's fat free and you should definitely keep it in on a high shelf out of reach, or you might find yourself eating the box in just a couple of days!", "overall": 5.0, "summary": "addictive.....", "unixReviewTime": 1184630400, "reviewTime": "07 17, 2007"}
{"reviewerID": "A2UHZY5FPP05QI", "asin": "B0000CCZYY", "reviewerName": "Lauren Hemedinger", "helpful": [0, 0], "reviewText": "I have tried other brands and this one is by far the best Licorice on the market today.  Buy it!", "overall": 5.0, "summary": "The Best", "unixReviewTime": 1355788800, "reviewTime": "12 18, 2012"}
{"reviewerID": "A2CKWT89SZKCA3", "asin": "B0000CCZYY", "reviewerName": "Mary E. Copper \"meca\"", "helpful": [0, 0], "reviewText": "I often buy this licorice at the health food store and it's expensive, but with the add on item program, I can tuck it into other purchases and get a great price.  So if you want the real thing a a great price, tuck it into the cart and get a bargain.", "overall": 5.0, "summary": "Real Licorice Real Tasty", "unixReviewTime": 1362960000, "reviewTime": "03 11, 2013"}
{"reviewerID": "A642EMSD5P7PA", "asin": "B0000CCZYY", "reviewerName": "R", "helpful": [1, 1], "reviewText": "Panda licorice, There is not too much I can say about panda licorice It's very good that's why I keep on buying it.", "overall": 5.0, "summary": "Panda licorice", "unixReviewTime": 1373587200, "reviewTime": "07 12, 2013"}
{"reviewerID": "A2OUNVRPRWH0", "asin": "B0000CCZYY", "reviewerName": "The Kittie \"Kittie\"", "helpful": [6, 11], "reviewText": "This is an awesome product, natural, not a lot of ingredients, good flavor, not too sweet.But I no longer love our scaredy-cat friends at Amazon! :PNow they won't let you write honest reviews of the product, so lame.What's insane is the price! I can easily get this same thing at the grocery store for 1/3 to 1/2 the price (not even on sale).But here it's at a greatly inflated rate AND they've made it an \"add-on\" item - shameful.Add-on is the worst new \"feature\" I've seen in the many, many years that I've been shopping at this site.I am a Prime member & signed up for that so I could get FREE shipping on ANY item at ANY time - not so I would STILL have to group items into $25 & higher orders. Pathetic. Way to go Amazon. :PBUT - this is ABSOLUTELY the best licorice out there! Just be careful if you have high blood pressure: it uses real licorice as the main flavoring & licorice root can increase a person's blood pressure.OK, Amazon, will you chicken out & block my review again??", "overall": 1.0, "summary": "Love this candy!", "unixReviewTime": 1367884800, "reviewTime": "05 7, 2013"}
{"reviewerID": "A2V3FFFM6MV5OM", "asin": "B0000CD06J", "reviewerName": "B. Ogatiy \"bogatiy\"", "helpful": [0, 0], "reviewText": "I see my review is pretty much in agreement with another review here. But I'll put it here anyway.I ordered this along with Pero Extra and Roastaroma to try the three. I'm a former Postum aficionado and had certainly developed quite a liking to Postum.Really can't take Pero Extra very much. I keep trying it again and again, prolly 10 times now, to see if I can develop a liking for it and just can't. I'm sure some people may like it, but it's just not for me.Cafix is what I'll usually go for, but it has a certain sort of built in sweetness (very mild, barely distinguishable)which comes from the beets that are added. Over time I've found it just sort of fills in some of the void from lack of Postum, and while it's not a Postum replica it has certain Postum like qualities.The Roastaroma actually is what I think tastes the best of the three, but it's taste is just not at all like Postum, is however very balanced and has a nice maltiness to it. Often I'll put just a little bit of Stevia powder in it. (I could always tell if I've ingested aspartame by (or nutrasweet, whatever) by how I felt, and try to verify any food/drink I ingest doesn't have aspartame. I mean, an item which arose out of research into nerve agents for warfare, and itself found to be an effective weapon, really shouldn't be passed off as a food item. Stevia is ground plant matter, even less processed that sugar.)The combo makes a really nice morning or late evening drink.", "overall": 4.0, "summary": "Close but not Postum", "unixReviewTime": 1339113600, "reviewTime": "06 8, 2012"}
{"reviewerID": "A1E3YHAJSITRGC", "asin": "B0000CD06J", "reviewerName": "Elley D.", "helpful": [0, 0], "reviewText": "This is a great tasting product. I use this sometimes instead of the Pero. This helped me to quit coffee.", "overall": 5.0, "summary": "Great product", "unixReviewTime": 1400025600, "reviewTime": "05 14, 2014"}
{"reviewerID": "AX04H2SPKO02S", "asin": "B0000CD06J", "reviewerName": "J. Wang \"jyswang\"", "helpful": [0, 3], "reviewText": "As soon as I had a couple of sips, my eczema started uncontrollably itching. That's one of the signs when something I eat is NOT gluten-free. Will return the item for a refund.", "overall": 1.0, "summary": "NOT gluten free", "unixReviewTime": 1362528000, "reviewTime": "03 6, 2013"}
{"reviewerID": "A3JZ0A8V857A2X", "asin": "B0000CD06J", "reviewerName": "Max", "helpful": [0, 0], "reviewText": "I like mine with a little milk and sweetener. It's much easier on the stomach than coffee is, and it has a pleasant taste. I use it as an alternative to teas on occasion.", "overall": 5.0, "summary": "Nice coffee substitute", "unixReviewTime": 1395360000, "reviewTime": "03 21, 2014"}
{"reviewerID": "A1XKQX71GJASJR", "asin": "B0000CD06J", "reviewerName": "Suzanne Deneuve Hall \"Suzanne\"", "helpful": [16, 17], "reviewText": "I bought a case of all three products, Inka, Pero and Cafix in order to compare them. Honestly? They are all the same, so go with whatever is the cheapest. I think I did like Cafix the best, but it may be a mental thing with the name at least sounding somewhat like Coffee. There is little difference in all three, they look identical with only tiny coloration differences. All by themselves they do not taste like coffee and if you are a black coffee drinker? Pass, because you will not be satisfied with the taste. It is very bland all by itself. BUT, if you like cream in your coffee? You won't even notice the difference between coffee and these products within a week or two you will forget you are not drinking coffee. I am PERFECTLY happy with all three products and will continue to drink them;I will choose by PRICE due to the very similar make of them all. The cans all read the same ingredient wise.", "overall": 5.0, "summary": "Pero, Inka, Cafix review...", "unixReviewTime": 1294963200, "reviewTime": "01 14, 2011"}
{"reviewerID": "AO1SEKOYNVM5N", "asin": "B0000CDBQN", "reviewerName": "amazon buyer", "helpful": [0, 0], "reviewText": "i use this on every pizza i have!sweet and spicy and goes good with the sweetness of the pizza sauce.i use the green version on white sauce pizza's :-)", "overall": 5.0, "summary": "love this!!!", "unixReviewTime": 1390435200, "reviewTime": "01 23, 2014"}
{"reviewerID": "A3E1KL2N4ZOQ8W", "asin": "B0000CDBQN", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Just a little is needed to get the full effect.  This seasoning blend is spicy hot, just like the label states.  It still tastes good, like the more mild version, but it has a definite kick to it.  What I like to do is mix the two, this one and Chef Paul Prudhomme's Magic Seasoning Blends ~ Pizza & Pasta Magic Herbal.  That way it is not too intense for me.", "overall": 5.0, "summary": "A recomended spicy hot blend", "unixReviewTime": 1186704000, "reviewTime": "08 10, 2007"}
{"reviewerID": "A3SXOJGQ8U0YA6", "asin": "B0000CDBQN", "reviewerName": "Don", "helpful": [0, 0], "reviewText": "I've commented on other spices from Chef Paul Prudhomme in the past. His all have great quality and spice mixture.", "overall": 5.0, "summary": "Great Brand", "unixReviewTime": 1362268800, "reviewTime": "03 3, 2013"}
{"reviewerID": "A1X1CEGHTHMBL1", "asin": "B0000CDBQN", "reviewerName": "jjceo", "helpful": [0, 0], "reviewText": "This is a great product to accent your pizza and pasta sauces without adding the things you don't want into your diet!  It is a little bit hot as a seasoning and you can also sprinkle it onto spaghetti or pizza.  It is also very good when sprinkled onto casseroles or soups.  I like it as it has no calories, no total fat, no sodium, no carbohydrates and no additional protein.  It also contains no MSG or any preservatives.It lets you add the zest you like without adding items like salt or calories.  This is a good product and we like it as a seasoning for many of our Italian dishes.  I recommend it to you as a good product.", "overall": 5.0, "summary": "Calling it Magic doesn't do it justice!", "unixReviewTime": 1343692800, "reviewTime": "07 31, 2012"}
{"reviewerID": "A290BW519DG9XO", "asin": "B0000CDBQN", "reviewerName": "Susanna K. Robbins Ttee", "helpful": [0, 0], "reviewText": "This is such a fantastic product - I use it all the time and will continue to order it.  Thank you, Paul Prudhomme!", "overall": 5.0, "summary": "FANTASTIC", "unixReviewTime": 1361836800, "reviewTime": "02 26, 2013"}
{"reviewerID": "A1HG82U7GY9531", "asin": "B0000CDEPD", "reviewerName": "J. Paschal", "helpful": [2, 8], "reviewText": "Okay so for the price, this is to be expected, after all, it's organic. I was in a pinch for vanilla extract (REAL Vanilla Extract) and I bought here on Amazon. I know for the same price, this cost just as much at my local Whole Foods, but I bought here and was quite pleased with the product. It's a real high quality extract and using it in my baked goods and some other dishes, I could tell the difference in taste. I use a lot of vanilla extract so for me the only real downside is/was they don't make it bigger. Perhaps I will have to buy this in bulk.", "overall": 3.0, "summary": "Organic Vanilla Extract", "unixReviewTime": 1320364800, "reviewTime": "11 4, 2011"}
{"reviewerID": "A1XAPRM0OO15SO", "asin": "B0000CDEPD", "reviewerName": "LISA LOU \"LISA MARIE\"", "helpful": [0, 1], "reviewText": "This was good stuff but I just went thru it too fast. So I bought my last really large bottle at BJ's wholesale and it tastes the same and does the job.", "overall": 5.0, "summary": "Good stuff", "unixReviewTime": 1371254400, "reviewTime": "06 15, 2013"}
{"reviewerID": "A1R19K6O4IAF5W", "asin": "B0000CDEPD", "reviewerName": "Terry", "helpful": [2, 2], "reviewText": "Very good vanilla extract and organic too! This comes in a close second to my homemade organic vanilla extract. Will keep a bottle in my cabinet, while waiting for mine to &#34;develop&#34;.", "overall": 5.0, "summary": "Much easier than making your own.", "unixReviewTime": 1365292800, "reviewTime": "04 7, 2013"}
{"reviewerID": "AY8UH4COUYMGZ", "asin": "B0000CDEPD", "reviewerName": "ttt", "helpful": [1, 2], "reviewText": "This bottle is a steal, at Whole Foods (at least where I live) a bottle half this size costs twice as much. Before I was also using imitation vanilla, it smells okay but you can smell the fillers. This bottle smells like fresh, pure vanilla. I used it in a lemon poppy seed cake and it was delicious, mild and aromatic! My kitchen smelled WONDERFUL!", "overall": 5.0, "summary": "The Only Vanilla I'll Buy From Now On!", "unixReviewTime": 1373673600, "reviewTime": "07 13, 2013"}
{"reviewerID": "A1RVOM92NT7WTM", "asin": "B0000CDEPD", "reviewerName": "Vickie D.", "helpful": [0, 0], "reviewText": "Very good and even better knowing it is organic. Like I said I will continue buying this product.i do a lot of  cooking.", "overall": 5.0, "summary": "Added it to my subscribe", "unixReviewTime": 1398643200, "reviewTime": "04 28, 2014"}
{"reviewerID": "A31EZQGRVKKYAZ", "asin": "B0000CETGM", "reviewerName": "J. Hesse", "helpful": [1, 2], "reviewText": "Jamaica Blue Mountain Coffee is my absolute favorite coffee.  It has a nice rich taste and a super smooth texture.  I have yet to find a coffee that I like near as much.  That being said, I bought my Blue Mountain Coffee in Jamaica...not online...so I can't vouch for the quality/freshness here.", "overall": 5.0, "summary": "My favorite coffee", "unixReviewTime": 1369008000, "reviewTime": "05 20, 2013"}
{"reviewerID": "A1BHCRAPM0OI1W", "asin": "B0000CETGM", "reviewerName": "Jim at Lansing \"Amazon is great, and offers g...", "helpful": [0, 0], "reviewText": "The coffee does have a production date and best/use by date. Maybe I am the only one, but my purchase came back as quite close to the use by date, so just be careful. The coffee is good.", "overall": 3.0, "summary": "Be aware of this produce", "unixReviewTime": 1322092800, "reviewTime": "11 24, 2011"}
{"reviewerID": "A3SFQQB23IZVVL", "asin": "B0000CETGM", "reviewerName": "J T Cannon Jr", "helpful": [0, 0], "reviewText": "So many coffee enthusiasts come back to Blue Mountain time and time again as one of the finest coffees you can find in the world.  This is so delicious it won't last long.", "overall": 5.0, "summary": "The Best in the World", "unixReviewTime": 1355788800, "reviewTime": "12 18, 2012"}
{"reviewerID": "A31BD4RXCON7QO", "asin": "B0000CETGM", "reviewerName": "Michael A. Duvernois", "helpful": [2, 7], "reviewText": "I mean this stuff was roasted how long ago? A far lesser coffee roasted a couple of days ago is going to taste a whole lot better. At $50 per pound, what you're tasting is justification for spending the money. What you should do, if you have the money for this sort of coffee, is buy a coffee roaster and start getting good green beans (including Jamaican Blue Mountain) and roasting them fresh yourself. The folks at Sweet Maria's have all the info you need to get started.", "overall": 3.0, "summary": "Decent coffee, but ridiculously priced for not fresh coffee", "unixReviewTime": 1249344000, "reviewTime": "08 4, 2009"}
{"reviewerID": "A1KZUXE70GYNGO", "asin": "B0000CETGM", "reviewerName": "talonmedic", "helpful": [50, 50], "reviewText": "First a little background on me. I Am a coffee drinking fiend. I probably keep several countries coffee production up, so I know coffee. I don't mind strong coffee or so so tasting coffee I just dont expect it to be expensive so so tasting coffee. I have had and love Jamaican Blue mountain coffee before but it was a lot more expensive than this. This came in a cute little burlap sack (you get some style points there) but after that it's pretty much down hill. The coffe is not the normal rich tasting wonderfull smelling JBM I have had before, it just tastes like every other coffee albeit at an extravagent price. I have ordered some more Blue mountain from another supplier will have to see how that goes. This is one that will not get any repeat business from me. There are plenty of other better tasting coffees out there at a lower price.", "overall": 3.0, "summary": "Not worth it for the money", "unixReviewTime": 1345075200, "reviewTime": "08 16, 2012"}
{"reviewerID": "AY12DBB0U420B", "asin": "B0000CFLCT", "reviewerName": "Gary Peterson", "helpful": [1, 1], "reviewText": "Probably at least three decades ago, I purchased a Melitta Cone Filter Manual Coffeemaker (6 cup). I was just getting started on grinding my own coffee and I read somewhere that this was the way to make the best coffee. I was very satisfied and it lasted for years and years. Then I met my wife. She took one look at my coffee-making operation and shook her head in disbelief. I needed a high-end coffeemaker. This just wouldn't do! Well, I ended up buying a Cuisineart Coffeemaker with all kinds of bells and whistles. It was good equipment and made a good cup of coffee, although the cost of the equipment was over 7 times that of my Melitta and the coffee wasn't as good. Plus, the equipment had to be meticulously cleaned and that quickly turned into an onerous task. My old Melitta was relegated to camping duties and finally lost.Well, my wife is now gone. And I was about to clean the Cuisineart Coffeemaker for the umpteenth time. I came up with the brilliant idea of going back to a Melitta. Good move! They were still around. I couldn't spot them in stores, but they were available on Amazon. What a neat gadget! I used it this morning and the coffee tasted so good! And it was so simple! And it took no longer than my super-duper coffeemaker. What a relief to be back to a simpler life. Well, I cleaned my Cuisineart Coffeemaker and stored it away. If I have guests, I can always break it out just to show them how I'm living the good life. Now, remember all that nasty business about cleaning that Cuisineart? Well, with the Melitta, you can just put the component parts into the upper rack of the dishwasher. The Melitta is clearly a superior coffee maker.Gary Peterson", "overall": 5.0, "summary": "Coffeemakers: The Melitta Is Better.", "unixReviewTime": 1355875200, "reviewTime": "12 19, 2012"}
{"reviewerID": "ACKXWTHOXXL2X", "asin": "B0000CFLCT", "reviewerName": "M. Husseini", "helpful": [0, 0], "reviewText": "really, it works just like a drip coffee maker but with the hassle that comes with cleaning them. I use and electric kettle to heat my water and it works well", "overall": 5.0, "summary": "amazing", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
{"reviewerID": "A3F91ZIAXKHIRW", "asin": "B0000CFLCT", "reviewerName": "moonshadow \"moonshadow\"", "helpful": [2, 2], "reviewText": "I have been intrigued by the pour over coffee makers. We have a Bunn automatic that uses pour over and it produces a good cup of coffee, but I DH likes his coffee strong and thus the coffee is usually a bit bitter for my taste.  I usually stick to tea. Everything I have read says the manual pour over produces a strong but smoother coffee.I priced out various pour over cones and carafes, but the priced seemed high when we didn't even know if we would like it. I saw this Melitta at a great add on price($9 @ my purchase). It seemed perfect for a starter set. The cost was less than some of the other brands paper filters. The set includes the cone filter, the carafe, a lid and 5 paper filters- everything you need to try it out. I considered getting the larger one, but another reviewer noted that the coffee does not stay warm long and figured we would be better off with a size we could drink quickly.  While I was looking for a non-plastic cone, this is BPA free. The carafe is made in Germany, the cone top is made in Canada.Now to the coffee... It is fantastic!  I use the espresso grind that DH uses in the Bunn.  The coffee is just as strong without the bitterness. It doesn't seem to take any more time. I use the Hario kettle on our induction stove so boiling water takes no time. Then, the pour over is almost zen like. I mainly use this on my late mornings and on weekends. We may eventually upgrade to ceramic cone, but this suits our needs at present.", "overall": 5.0, "summary": "Great purchase", "unixReviewTime": 1368230400, "reviewTime": "05 11, 2013"}
{"reviewerID": "AI0BCEWRE04G0", "asin": "B0000CFLCT", "reviewerName": "Stoney", "helpful": [68, 74], "reviewText": "EASY OF USEI've used the Mellita Coffee System for about 40 years. I find the system more convenient than coffee machines.> If the power goes off, you can still make coffee if you have a gas stove or a camp stove.> It is easy to brew  exactly the amount of coffee you want, and exactly the strength that you want---including adjusting to new roast and grinds. You can even mix caffeinated and decaffeinated coffees if you wish.> In a way, the Mellita system is more \"sanitary\". It is easy to forget a used filter in a coffee maker, maybe for weeks if you go on a vacation, and find a fungus garden in there. You can't ignore a used Melitta filter, because it is out in the open. If you forget a used Melitta filter, it and the coffee grinds just dry out.  It is also much easier to wash the Melitta components---just a quick rinse under the tap is usually good enough.  Caveat--some types of coffee are oiler than others---you may need to actually wash your cone and carafe if a quick rinse is not sufficient.SIZE OPTIONSThe carafes for which the \"6 cup\" and \"10 cup\" systems can nominally hold 6 or 10 cups off coffee (filled to the brim), but that is really irrelevant.  A more important consideration is cups vs mugs.  How many people still drink \"cups\" of coffee?  So, it is the \"mug-capacity\" (1 mug = 1 1/2 cups) of the filters and cones which really counts.#2 filters/conesRecomemnded: 1 cupPractical Maximum: 1 mugTheoretical Maximum: 2 cups#4 filters/cones (\"6 cup system\")Recommended: 1-2 mugsPractical Maximum:  2 1/2 mugsTheoretical Maximum: 4 mugs#6 filters/cones (\"10 cup system\")Recommended: 2-3 mugsPractical Maximum: 4 mugsTheoretical Maximum: 6 mugsHowever, I don't follow my own recommendation:  In the morning, I want coffee \"now!\"  I often run out of patience trying to brew even 1 mug of coffee using #4 filter/cones.  On the other hand, the #6 filter/cones holds a whole mug of hot water in one quick pour, and drains about as fast as you can continue to pour the water in---so I find it very convenient for brewing 1 to 2 mugs of coffee at a time, and on rare occasions to easily brew 4 mugs (6 cups) of coffee.  However, in this case, the hot water has little time to extract the flavor from the coffee.  To compensate, I grind my coffee very finely.  I could simply use more coffee, but that would be wasteful.The #6 filters/cones (\"10-cup system\") is faster and more flexible, at a slightly higher cost for the filters.Melitta Cone Filter Coffeemaker 10 Cup, 1-CountIf you are patient and your space is very limited, such as in a camper, boat, or in a college dorm, or if you really want only 1 or 2 mugs of coffee at a time, #4 filter/cones (the so-called \"6 cup system\") is a good choice.GRINDS OF COFFEEIf you usually brew the \"recommended\" or fewer number of mugs of coffee, then very-finely ground coffee is recommended. If you usually brew the the \"recommended\" or more number of mugs at a time, then a medium grind coffee may work best.  Most supermarket \"fine grind\" is actually a medium grind.  If you brew more than the \"practical maximum\" a medium-coarse grind will work better.  If you grind your own coffee in an electric grinder, \"coarse\" is only a second or two, medium-fine is perhaps 10 seconds, and very fine is perhaps 30 seconds, until the pitch of the sound changes, indicating that no more grinding is taking place.REUSEIf you use very-fine grind, then discard the used filter when finished (because most of the flavor will be extracted, and the filter will be clogged up by the fine grinds).  If you use a medium grind, then you can optionally reuse the grinds in the afternoon to make a second batch of coffee (which will be lower in caffeine).  Coffee-freaks may object to reusing grinds, but it works just fine.FORMULARegardless of the grind, you have to use the same formula for the TOTAL amount of coffee actually made, i.e., 1 to 2 tablespoons of ground coffee per mug, depending on your taste, brand, etc.FILTERSPresumably, brown filters are easier on the environment---and on you, less chemicals having been used to manufacture them.  Unfortunately, #6 filters are hard to find in most grocery stores, but easy to purchase via Amazon.Melitta Cone Coffee Filters, Natural Brown, No. 6, 40-Count Filters (Pack of 12)Melitta Cone Coffee Filters, Natural Brown, No. 2, 100-Count Filters (Pack of 6)Melitta Cone Coffee Filters, White, No. 6, 40-Count Filters (Pack of 12)In an emergency, you can use #4 filters in a #6 cone, but you'll regret it (having been spoiled by the convenience of #6 filters).RECOMMENDATIONS ON MAKING GOOD COFFEE>>Use fresh unchlorinated water if possible.  Do not use \"softened\", \"sparkling\", or \"mineral\" water.  If you let an open pitcher of water sit on a counter for a few hours (or overnight), most of the chlorine will evaporate.  The best way to get pure water is a reverse-osmosis system.  Bring the water to a quick boil, but don't leave it boiling too long--that will flush out the dissolved oxygen, leaving the coffee tasting flat.>>There is a huge difference between brands and roasts.  Experiment and enjoy.  However, even more important is freshness---which is the greatest challenge.  How can you know if the coffee is fresh?  The easiest way is to signup with a service such as Gavelia, Boca Java, or Coffee Bean Direct--whose only business is providing you with freshly roasted (and freshly-ground if you wish) coffee.>>Particularly if you do not use a \"coffee service\", its best to buy whole beans and grind them just before brewing.  A $15 grinderKrups 203-42 Fast Touch Coffee Grinder, Blackis as good as a $200 grinder. It takes only a few seconds to grind a batch of coffee while waiting for the water to boil.>>For newbies, \"French\" or \"dark roast\" coffee is rich and bitter, and usually brewed \"strong\".  Light roasts are more complex, but some are acidic, and are usually brewed and drank more like tea.  Light roast Indonesian coffee is particularly complex.  Caveat, \"complex\" does not necessarily mean flavorful---some dark roasts are wonderful, but it is probably harder to find a good dark roast.  TheCoffee Bean Direct Assorted Whole Bean Coffee Sampler, 9-Pound Boxavailable from Amazon is a good way to explore the varieties of coffee.>>The filter cone and carafe should be rinsed off after every use, otherwise your coffee can be contaminated with stale oils. A weekly wash in the dishwasher won't hurt.>>Elsewhere, you'll read endless nonsense about the exact water temperature, how fast or how slow to pour the water, the value of porcelain vs plastic cones, preheating the cones with hot water, how finely ground the coffee should be, etc.  It's all nonsense (except possibly to engineers who design coffeemakers). 99% of what matters is the quality of the ingredients: water and coffee.  You want fresh oxygenated chlorine-free salt-free water, and good quality recently-roasted and recently-ground coffee.SAFETYIt is easy to forget the glass carafe on a hot stove.  I broke at least 6 carafes before I purchased a whistling teakettle.Revere 2-1/3-Quart Whistling Tea KettleNEVER use the carafe to boil water or reheat coffee.  The flood of water might crack a ceramic stovetop, or put out a the flame of a gas stove---both causing catastrophic problems.  Use your microwave to reheat (1 mug of coffee = 30-45 seconds); it's faster and safer.It is important to take care to pour the boiling water into the filter, not between the filter and the filter cone. It is any easy accident to make. To minimize such accidents, fold over the \"joined\" edges of the filters so that the filter opens wider. If you are a particular klutz, a quick rinse with a little cold water before you add the ground coffee can \"glue\" the filter to the cone.SUGAR IN YOUR COFFEE?Purist insist that coffee should always be drank black.  While I tentatively agree, I can't.  My taste-buds are overly sensitive to bitterness.  However, I have found that pure SteviaPure Stevia Extract Powder by Kal - 3.5 ozis a good replacement for sugar for me.  Oddly, it isn't as sweet as sugar, but is just as effective in cutting the bitterness, which is what I really need.  Truvia and other brands in packets or described as \"spoonable\" contain bulking agents which effect the flavor and leave a yucky residue, and are comparatively expensive.  KAL Pure Stevia contains no bulking agents and is very economical.SALT IN YOUR COFFEE?It's a naval tradition.  I've found that a few grains of sea-salt in a cup of light-roast coffee can be pleasant, but not so compelling that I make a habit of it.  However, a little salt is more noticeable (in a good way) in ice coffee.MILK IN YOUR COFFEE?If the purpose is just to cut the acidity, then you need to try a different coffee or brewing method.  If the purpose is to cut the bitterness, you might want to try stevia instead.  If you simply like milk in your coffee---I say, indulge yourself with a little real (not fake) half-and-half, or even heavy cream.  I usually drink my coffee black with a little stevia, but for a rare desert cup, real sugar and real cream are essential.GENERAL SHOPPING RECOMMENDATIONAfter major grocery shopping expeditions, sit down at your computer with your receipt, and check if you can buy any of the non-perishables through Amazon. When you find items (even if more expensive than you just paid), put the item on your Amazon wish list, and add a note to the wish list of the price you just paid. Check your wish list frequently, and when you see an item you need at a bargain price, buy it.", "overall": 5.0, "summary": "Does the job", "unixReviewTime": 1307404800, "reviewTime": "06 7, 2011"}
{"reviewerID": "A302AJDPQIH01F", "asin": "B0000CFLCT", "reviewerName": "TanteCindy", "helpful": [0, 0], "reviewText": "I used to have a larger Melitta manual coffeemaker.  When the carafe broke (can any glass carafe survive a close encounter with a tile floor?) , I didn't replace it because I no longer needed such a large coffeemaker.  I thrashed around trying to find a smaller coffeemaker that made coffee as well as my reliable old Melitta with no success.  I was delighted to find this smaller Melitta model here at Amazon.  I am once again enjoying delicious coffee using my preferred type of coffeemaker.", "overall": 5.0, "summary": "Still a great way to make coffee", "unixReviewTime": 1362787200, "reviewTime": "03 9, 2013"}
{"reviewerID": "ABPZ330FEQ1GM", "asin": "B0000CFLCT", "reviewerName": "The World's Greatest", "helpful": [0, 0], "reviewText": "This works just like it look in the picture, simple easy way to make good coffee if your using good coffee and the right amount of coffee and quality water. Only complaint is the bottom hole were the coffee comes out of the funnel looks like it was broken off its mold crudely rather than cleanly cut like on my single Melitta pour over.", "overall": 5.0, "summary": "Works good", "unixReviewTime": 1376870400, "reviewTime": "08 19, 2013"}
{"reviewerID": "APGE05SC50SPL", "asin": "B0000CFLCT", "reviewerName": "Thomas (Sherri's husband)", "helpful": [0, 0], "reviewText": "This is a basic drip funnel and carafe that uses a #4 filter.I've been a fan of steam espresso machines for twenty years, every day, every day for twenty years.  The problem, the espresso machines would scale up and either need cleaning (descaling) or blow the safety valve in the lid and be rendered useless.  We have gone through countless steam espresso machines over the years and spent many a Saturday (yes, the whole day) soaking the espresso machine in descaling solution and then cleaning the descaling solution out of the espresso machine so the first cup in the morning, wouldn't taste like descaling solution.Well, we can no longer find.....anywhere, basic steam espresso machines as all we can find are fancy espresso machines that will quickly clog up with scale or drip coffee makers that churn out weak, watery coffee shop style coffee.....\"More coffee hun?\"  Do you really want to know?Enters this drip carafe as I tried making drip coffee out of a paper towel and a strainer and found the coffee to be acceptable but still a bit bitter and not up to par.  I ordered up this carafe with six hundred #4 filters at less than one-third the cost of what a replacement steam espresso coffee maker would have cost, based upon the last purchase price of eighty dollars US.Yes, it's a bit of a \"BIG\" pain to make a carafe of coffee.  The water needs to be heated in a microwave, two cups at a time for four minutes and then slowly drizzled over the fresh grinds until all the water has been allowed to drain through the filter.  This needs to be done twice, using three heaping teaspoons of fresh ground, French Roast, coffee beans, in each of two filter baskets.The good, now that's what I'm talking about!  The resulting coffee is fresh, thick, robust, smooth, full flavor, that's what I'm talking about, coffee.  The point, if you care about your coffee and how it tastes, for the effort, this is for you.  We drink our coffee black and do not find need to add creams, sugars or otherwise to make it palpable as we like our coffee in the morning, just as it is, perfectly black.An aside, we buy filters, six hundred filters at a time.  We use three to four filters each morning as we brew up coffee at the rate of sixteen ounces per three heaping teaspoons of fresh ground coffee, per filter.  Doing the math, this is about a six month supply of coffee filters.If you're looking for convenience, dash and go, this is not for you.  If you're looking to have fresh, smooth, robust coffee in the morning and don't mind the hassle it takes to get what you want, this package is definitely for you.---------------------Addendum:I like this combination so much that today, 10Aug13, I purchased a second pot/filter cone combination.  FYI, the coffee is the best morning coffee we've had.  We are very happy with the coffee this hand pour drip system makes.  It's a bit slow working with a single filter cone so in a few days, we'll have a second pot/filter cone to speed the morning coffee making process up.  Yes, more cleaning after making coffee but definitely worth the extra effort.", "overall": 5.0, "summary": "I love it.", "unixReviewTime": 1373500800, "reviewTime": "07 11, 2013"}
{"reviewerID": "A3MMJEMXBJOJ8H", "asin": "B0000CFLIL", "reviewerName": "Carlgo", "helpful": [0, 0], "reviewText": "No more looking in stores to see piles of #2 and #4 filters, but no #6s. So much easier to use than the smaller ones. And of course the price is right in bulk and no gas used looking for them. I like the Melitta system, coffee competitive with more complex methods at a lower price.", "overall": 5.0, "summary": "Yay, I have a case of these now", "unixReviewTime": 1390953600, "reviewTime": "01 29, 2014"}
